content/posts/free_energy_principle.md
+++
title = "free energy principle"
author = ["Cameron Smith"]
lastmod = 2020-09-20T20:09:50-04:00
slug = "free_energy_principle"
draft = false
+++

## [intrinsic motivation]({{< relref "intrinsic_motivation" >}}), [variational inference]({{< relref "variational_inference" >}}), [probabilistic inference]({{< relref "probabilistic_inference" >}}), [statistical physics]({{< relref "statistical_physics" >}}), [Bayesian brain hypothesis]({{< relref "Bayesian_brain_hypothesis" >}}) {#intrinsic-motivation--intrinsic-motivation-dot-md--variational-inference--variational-inference-dot-md--probabilistic-inference--probabilistic-inference-dot-md--statistical-physics--statistical-physics-dot-md--bayesian-brain-hypothesis--bayesian-brain-hypothesis-dot-md}


## First heard of this in [Mindscape 87 | Karl Friston on Brains, Predictions, and Free Energy \* YouTube](<https://www.youtube.com/watch?v=TcFLQvz5uEg&t=844s>) the Mindscape podcast episode interviewing [Karl Friston]({{< relref "Karl_Friston" >}}) on <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-03-09 Mon&gt;</span></span> {#first-heard-of-this-in-mindscape-87-karl-friston-on-brains-predictions-and-free-energy-youtube--https-www-dot-youtube-dot-com-watch-v-tcflqvz5ueg-and-t-844s--the-mindscape-podcast-episode-interviewing-karl-friston--karl-friston-dot-md--on}


## Considered here as that developed by [Karl Friston]({{< relref "Karl_Friston" >}}) originally (to the best of my knowledge as of <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-05-14 Thu&gt;</span></span>) in [A theory of cortical responses by Karl Friston in 2005]({{< relref "A_theory_of_cortical_responses_by_Karl_Friston_in_2005" >}}) and most recently in [A free energy principle for a particular physics by Karl Friston in 2019]({{< relref "A_free_energy_principle_for_a_particular_physics_by_Karl_Friston_in_2019" >}}) {#considered-here-as-that-developed-by-karl-friston--karl-friston-dot-md--originally--to-the-best-of-my-knowledge-as-of--in-a-theory-of-cortical-responses-by-karl-friston-in-2005--a-theory-of-cortical-responses-by-karl-friston-in-2005-dot-md--and-most-recently-in-a-free-energy-principle-for-a-particular-physics-by-karl-friston-in-2019--a-free-energy-principle-for-a-particular-physics-by-karl-friston-in-2019-dot-md}


## \_\_The free energy principle tries to explain how biological systems remain in non-equilibrium steady-states by restricting themselves to a limited number of states.\_\_ — via [Free energy principle \* Wikipedia](<https://en.wikipedia.org/wiki/Free%5Fenergy%5Fprinciple>) {#the-free-energy-principle-tries-to-explain-how-biological-systems-remain-in-non-equilibrium-steady-states-by-restricting-themselves-to-a-limited-number-of-states-dot-via-free-energy-principle-wikipedia--https-en-dot-wikipedia-dot-org-wiki-free-energy-principle}


## [1st International Workshop on Active Inference](<https://iwaiworkshop.github.io/>#) to be held <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-09-14 Mon&gt; </span></span> with paper submission deadline <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-06-09 Tue&gt;</span></span>. {#1st-international-workshop-on-active-inference--https-iwaiworkshop-dot-github-dot-io--to-be-held-dot}


### Submissions are being accepted in [LNCS overleaf](<https://www.overleaf.com/latex/templates/springer-lecture-notes-in-computer-science/kzwwpvhwnvfj#.WuA4JS5uZpi>) format {#submissions-are-being-accepted-in-lncs-overleaf--https-www-dot-overleaf-dot-com-latex-templates-springer-lecture-notes-in-computer-science-kzwwpvhwnvfj-dot-wua4js5uzpi--format}


## [references]({{< relref "references" >}}) {#references--references-dot-md}


### [Principles of the self-organizing system by W. Ross Ashby in 1962]({{< relref "Principles_of_the_self-organizing_system_by_W_Ross_Ashby_in_1962" >}}) {#principles-of-the-self-organizing-system-by-w-dot-ross-ashby-in-1962--principles-of-the-self-organizing-system-by-w-ross-ashby-in-1962-dot-md}

<!--list-separator-->

-  Chapter 29 in [Facets of Systems Science 2nd ed by George Klir in 2001]({{< relref "Facets_of_Systems_Science_2nd_ed_by_George_Klir_in_2001" >}})


### [The free energy principle for action and perception A mathematical review by Christopher Buckley, Anil Seth, et al in 2017]({{< relref "The_free_energy_principle_for_action_and_perception_A_mathematical_review_by_Christopher_Buckley,_Anil_Seth,_et_al_in_2017" >}}) {#the-free-energy-principle-for-action-and-perception-a-mathematical-review-by-christopher-buckley-anil-seth-et-al-in-2017--the-free-energy-principle-for-action-and-perception-a-mathematical-review-by-christopher-buckley-anil-seth-et-al-in-2017-dot-md}


### [A tutorial on the free-energy framework for modeling perception and learning by Rafal Bogacz in 2017]({{< relref "A_tutorial_on_the_free-energy_framework_for_modeling_perception_and_learning_by_Rafal_Bogacz_in_2017" >}}) {#a-tutorial-on-the-free-energy-framework-for-modeling-perception-and-learning-by-rafal-bogacz-in-2017--a-tutorial-on-the-free-energy-framework-for-modeling-perception-and-learning-by-rafal-bogacz-in-2017-dot-md}


### [Active inference on discrete state-spaces - a synthesis by Lancelot Da Costa, Thomas Parr, Karl Friston et al in 2020]({{< relref "Active_inference_on_discrete_state-spaces_--_a_synthesis_by_Lancelot_Da_Costa,_Thomas_Parr,_Karl_Friston_et_al_in_2020" >}}) {#active-inference-on-discrete-state-spaces-a-synthesis-by-lancelot-da-costa-thomas-parr-karl-friston-et-al-in-2020--active-inference-on-discrete-state-spaces-a-synthesis-by-lancelot-da-costa-thomas-parr-karl-friston-et-al-in-2020-dot-md}


### [Inferring what to do (and what not to) by Thomas Parr in 2020]({{< relref "Inferring_what_to_do_(and_what_not_to)_by_Thomas_Parr_in_2020" >}}) {#inferring-what-to-do--and-what-not-to--by-thomas-parr-in-2020--inferring-what-to-do-and-what-not-to--by-thomas-parr-in-2020-dot-md}


### [Oleg Solopchuk – Medium](<https://medium.com/@solopchuk>) {#oleg-solopchuk-medium--https-medium-dot-com-solopchuk}

<!--list-separator-->

-  [Tutorial on Active Inference \* Oleg Solopchuk \* Medium](<https://medium.com/@solopchuk/tutorial-on-active-inference-30edcf50f5dc>)


## ^^Comments^^ {#comments}


### At the core of the background necessary to understand the [free energy principle]({{< relref "free_energy_principle" >}}) is the relationship between free energy as it is used in [statistical physics]({{< relref "statistical_physics" >}}) versus its use in [probabilistic inference]({{< relref "probabilistic_inference" >}}) which is encapsulated in the notion of [variational inference]({{< relref "variational_inference" >}}). The best explanation I know of this relationship is in the formulation of Gibbs free energy via a variational principle in [Information, physics, and computation by Marc Mezard and Andrea Montanari in 2009]({{< relref "Information,_physics,_and_computation_by_Marc_Mezard_and_Andrea_Montanari_in_2009" >}}). {#at-the-core-of-the-background-necessary-to-understand-the-free-energy-principle--free-energy-principle-dot-md--is-the-relationship-between-free-energy-as-it-is-used-in-statistical-physics--statistical-physics-dot-md--versus-its-use-in-probabilistic-inference--probabilistic-inference-dot-md--which-is-encapsulated-in-the-notion-of-variational-inference--variational-inference-dot-md--dot-the-best-explanation-i-know-of-this-relationship-is-in-the-formulation-of-gibbs-free-energy-via-a-variational-principle-in-information-physics-and-computation-by-marc-mezard-and-andrea-montanari-in-2009--information-physics-and-computation-by-marc-mezard-and-andrea-montanari-in-2009-dot-md--dot}


### What is the relationship between the free energy principle and [active inference]({{< relref "active_inference" >}})? {#what-is-the-relationship-between-the-free-energy-principle-and-active-inference--active-inference-dot-md}

<!--list-separator-->

-  <https://wiki.ubc.ca/Course:CPSC522/Learning%5FAttention%5Fvia%5FActive%5FInference#Active%5FInference>

<!--list-separator-->

-  <https://en.wikipedia.org/wiki/Free%5Fenergy%5Fprinciple#Active%5Finference>
